{"data":{"markdownRemark":{"html":"<h2>Specification</h2>\n<p>In the root of the project there will be a <em>sites</em> folder that contains a site folder for each site. The site folder contains a <g-link to=\"/litlog/files/\">files</g-link> folder which has the project files in it including a <em>src/pages/litlog/</em> folder. This folder\ncontains <g-link to=\"/litlog/requests/\">requests</g-link>, <g-link to=\"/litlog/tasks/\">tasks</g-link>, and <g-link to=\"/litlog/changes/\">changes</g-link>. <em>slugs</em> are references to items in these folders.</p>\n<p><g-link to=\"/litlog/requests/\">requests</g-link> will contain Requests. Requests will have a title, a date, a status (open/closed), and a body which represents the specification of the request. The slug of an individual request is <em>requests/request-number</em> where <em>number</em> is a one-up number. The body may start as blank but details can be filled in through an iterative process.</p>\n<p><g-link to=\"/litlog/tasks/\">tasks</g-link> will contain Tasks. Tasks will have a title, date, a status (not-started/in-progress/completed), a request field, and a body which represents the plan and/or execution of the task in ordered steps. The slug of an individual task is <em>tasks/task-number</em> where <em>number</em> is a one-up number. </p>\n<p><g-link to=\"/litlog/changes/\">changes</g-link> will contain Changes. Changes will have a title (Create/Update), status (created/creating/updated/updating), and a body which includes details about the change. The gerund version of the verb (creating/updating) indicates work on that file is in process. The past tense version of the verb (created/updated) indicates work on that file is complete. The slug of an individual change is <em>changes/referent-slug/datetime</em> where <em>referent-slug</em> is the slug of the referent and <em>datetime</em> is an <a href=\"https://en.wikipedia.org/wiki/ISO_8601\">ISO 8601</a> when the change was made without the colon between hours and minutes or minutes and seconds (i.e., \"2018-06-08T0800\"). Changes to changes are not recorded since this would be recursive.</p>","frontmatter":{"title":"Create a documentation site to record changes to the site"}}},"pageContext":{"slug":"/requests/request-1/"}}